def get_list():
    """
    Четвертий етап практичної роботи. Ця частина цілком повторює третій.
    Створює та повертає список ASCII рисунків тварин, внесених до програми, як в другому етапі.

    Функція використовує raw строку (r """ """) для коректного відображення спеціальних символів без екранування.
    У результаті програма повертає список ASCII зображень шести тварин при виконанні програми.
    
    """
    camel = r"""
The camel habitat...
     ____.-'''''-.
    /___   @     |
    ',,,,.       |        _.-'''''-.,_
         '       |       /            \
         |       \    _.'              \
         |        '.-'                  '-.
         |                                 ',
         |                                  '',
          ',,-,                             ':;
               ',,| ;,,                   ,' ;;
                  ! ; !'',,,,',',,,,,'!  ;   ;:
                 : ;  ! !         ! ! ;  ;   :;
                ; ;    ! !        ! !  ; ;   ;,
               ; ;     ! !       ! !   ; ;

Look at that!"""

    lion = r"""
The lion habitat...
                                                     ,w.
                                                   ,YWMMw  ,M  ,
                           _.----.._   __..-----._.'MMMMMw,wMWmW,
                      _.-""         '''             YP"WMMMMMMMMMb,
                   .-' __.'                       .'    MMMMW^WMMMM;
        _,       .'.-'"; `,          /`      .--""     :MMM[==MWMW^;
     ,mM^"     ,-'.'  /    ;        ;       /  ,       MMMMb_wMW"  @\
    ,MM:.    .'.-'  .'      ;       `\     ;   `,      MMMMMMMW `"=./`-,
    WMMm__,-'.'    /       _.\         F'''-+,, ;_,_.dMMMMMMMM[,_ / `=_}
    "^MP__.-'   ,-'  _.--""   `-,     ;      \  ; ;MMMMMMMMMMW^``; __|
               /   .'            ;   ;        )  )`{  \ `"^W^`,   \  :
              /  .'             /   (       .'  /     Ww._     `.  `"
             /  Y,              `,   `-,=,_{   ;      MMMP`""-,  `-._.-,
            (--, )                `,_ / `)  \/"")      ^"      `-, -;"\:
The lion is roaring!"""

    deer = r"""
The deer habitat...
       /|       |\ 
    `__\\       //__' 
       ||      || 
     \__`\     |'__/ 
       `_\\   //_' 
       _.,:---;,._ 
       \_:     :_/ 
         |@. .@| 
         |     | 
         ,\.-./ \ 
         ;;`-'   `---________-----.-. 
         ;;;                         \_\ 
         ';;;                         | 
          ;     |                     ; 
           \    \    \        |       / 
            \_,  \   /        \     |\ 
              |';|  |,,,,,,,,/ \    \ \_ 
              |  |  |           \   /   | 
              \  \  |           |  / \  | 
               | || |           | |   | | 
               | || |           | |   | | 
               | || |           | |   | | 
               |_||_|           |_|   |_|
              /_//_/           /_/    /_/ 
Pretty good!"""

    goose = r"""
The goose habitat...
    
                                       _
                                   ,-"" "".
                                 ,'   ____ `.
                               ,'   ,'    `. `._
      (`.         _..--.._   ,'   ,'        \   \
     (`-.\    .-""        ""'    /          ( d _b
    (`._  `-"" ,._              (            `-( \
    <_ `      ( <`<              \            `-._\
     <`-       (__< <             :
      (__       (_<_<             ;
       `------------------------------------------
Beautiful!"""

    bat = r"""
The bat habitat...    
    _________________               _________________
     ~-.              \  |\___/|  /              .-~
         ~-.           \ / o o \ /           .-~
            >           \\  W  //           <
           /             /~---~\             \
          /_            |       |            _\
             ~-.        |       |        .-~
                ;        \     /        i
               /___      /\   /\       ___\
                    ~-. /  \_/  \ _.-~
                       V         V
It's doing fine."""

    rabbit = r"""
The rabbit habitat...
             ,
            /|      __
           / |   ,-' /
          Y :|  /   /
          | jj /( .^
          >-"~"-v"
         /       Y
        jo  o    |
       ( ~T~     j
        >._-' _./
       /   "~" |
      Y     _, |
     /| ;-"~ _  l
    / l/ ,-"~    \
    \//\/      .- \
     Y        /    Y
     l       I     !
     ]\      _\    /"\
    (" ~----( ~   Y.  )
It looks fine!"""

    return [camel, lion, deer, goose, bat, rabbit]











def select_animal():
    """
    Змінена функція 4 етапу. Нескінченний цикл з можливістю вибору тварини та можливістю виходу.

    Функція працює у циклі, дозволяючи користувачу багаторазово обирати рисунки тварин. Введення "exit" завершує роботу.

    В іншому, повністю повторює роботу третього етапу:
    У цій функції запитується у користувача номер тварини, після чого виводиться
    відповідний ASCII рисунок. Йде перевірка за допомогою інструкції try, в якій за допомогою оператору
    if виконується перевірка номеру. Якщо такий номер є, виводиться рисунок. Ні - повідомлення про невірний номер.
    Завершує роботу задане повідомлення за допомогою print().
    """
    animals = get_list()

    while True:
        inp = input("Please enter the number of the habitat you would like to view: > ")

        if inp.lower() == 'exit':
            print("See you later!")
            break

        try:
            number = int(inp)

            if 0 <= number < len(animals):
                print(animals[number])
            else:
                print("Invalid number.")

        except ValueError:
            print("Please enter a valid number.")




def main():
    """
    Основна функція для виконання цього етапу.

    Вона викликає функцію select_animal(), запускаючи виконання функції обирання номеру тварини, що, в свою чергу, звертається до функції get_list() для отримання рисунка
    """
    select_animal()


if __name__ == "__main__":
    main()